# NetworkErrorCalculatingPressure Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPCalculationFailures..::..NetworkErrorCalculatingPressure Property
BuiltInFailures..::..MEPCalculationFailures Class See Also
---
The pressure calculation could not be performed.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NetworkErrorCalculatingPressure { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NetworkErrorCalculatingPressure As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NetworkErrorCalculatingPressure {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPCalculationFailures Class
Autodesk.Revit.DB Namespace